Show / Hide Table of Contents
Class BoltGrid
Data of the bolt grid
Inheritance
System.Object
BoltGrid
AnchorGrid
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class BoltGrid
Properties
Improve this Doc   View Source
AnchorLen
Anchor lenght
Declaration
public double AnchorLen { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
AxisX
Bolt grid LCS - Axis X
Declaration
public Vector3D AxisX { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
AxisY
Bolt grid LCS - Axis Y
Declaration
public Vector3D AxisY { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
AxisZ
Bolt grid LCS - Axis Z
Declaration
public Vector3D AxisZ { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
BoltAssemblyName
The description of the bolt assembly
Declaration
public string BoltAssemblyName { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
BoreHole
The BoreHole of bold
Declaration
public double BoreHole { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ConnectedPartIds
Id of the weld
Declaration
public List<string> ConnectedPartIds { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.String>
Improve this Doc   View Source
ConnectedPlates
Identifiers of the connected plates
Declaration
public List<int> ConnectedPlates { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.Int32>
Improve this Doc   View Source
DiagonalHeadDiameter
The Diagonal Head Diameter of bold
Declaration
public double DiagonalHeadDiameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Diameter
The diameter of bold
Declaration
public double Diameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
HeadDiameter
The head diameter of bold
Declaration
public double HeadDiameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
HeadHeight
The Head Height of bold
Declaration
public double HeadHeight { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
HoleDiameter
The diameter of the hole
Declaration
public double HoleDiameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Id
Unique Id of the bolt grid
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
IsAnchor
Is Anchor
Declaration
public bool IsAnchor { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Material
The material of the bolt assembly
Declaration
public string Material { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
NutThickness
The Nut Thickness of bold
Declaration
public double NutThickness { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Origin
Origin of the bolt grid LCS
Declaration
public Point3D Origin { get; set; }
Property Value
 Type |  Description
 Point3D
Improve this Doc   View Source
Positions
Positions of holes in the local coodinate system of the bolt grid
Declaration
public List<Point3D> Positions { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<Point3D>
Improve this Doc   View Source
Standard
The standard of the bolt assembly
Declaration
public string Standard { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
TensileStressArea
The Tensile Stress Area of bold
Declaration
public double TensileStressArea { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source